"""Задача: порекомендовать фильмы в определенной категории.

Напишите программу, которая запрашивают информацию у пользователя,
делает запросы в базу данных и выводит результат.
Работаем с базой данных фильмов Sakila.

1. При запуске программы выводится список категорий (номер и название категории)

2. Пользователь может ввести номер категории

3. Программа выводит все фильмы в данной категории, но не более 10 фильмов.
О фильме выводится следующая информация: название, год выпуска, описание.
* Опционально - список актёров.
ВАЖНО: программа должна запускаться из терминала.
"""
