"""Создать функцию get_total_statistics, которая
 - принимает текст
 - и возвращает словарь в формате <буква: её количество в тексте>.

Перед начало работы текст необходимо перевести в нижний регистр.
"""
from pprint import pprint


def get_total_statistics(text):
    pass


some_text = 'Bernard Shaw: "Life isn\'t about finding yourself. Life is about creating yourself."'
pprint(get_total_statistics(some_text))
