"""Создать функцию get_statistics_by_words, которая
 - принимает текст
 - и возвращает словарь в формате <буква: [её количество в каждом слове, где есть хотя бы одна]>.

Перед начало работы текст необходимо перевести в нижний регистр.
"""
from pprint import pprint


def get_statistics_by_words(text):
    pass


text = 'Mark Twain: "I have never let my schooling interfere with my education.""'
pprint(get_statistics_by_words(text))
