"""Во входном файле задаётся число.
Необходимо в выходной файл вывести треугольник Паскаля,
который будет занимать верхний левый угол.
Воспользуйтесь расчётом биномиального коэффициента в цикле.
ВАЖНО: Деление одного факториала на произведение двух других ВСЕГДА
даёт целочисленный результат!
https://ru.wikipedia.org/wiki/%D0%A2%D1%80%D0%B5%D1%83%D0%B3%D0%BE%D0%BB%D1%8C%D0%BD%D0%B8%D0%BA_%D0%9F%D0%B0%D1%81%D0%BA%D0%B0%D0%BB%D1%8F
"""

from math import factorial as f


def bk(n, k):
    return ...



