"""Напишите программу (или функцию), которая запрашивает у пользователя
имя файла (переменная file) и целое число (переменная lines),
а затем выводит на печать построчно последние строки в количестве lines
(на всякий случай проверим, что задано положительное целое число).

Протестируем функцию на файле article.txt со следующим содержимым:

Вечерело
Жужжали мухи
Светил фонарик
Кипела вода в чайнике
Венера зажглась на небе
Деревья шумели
Тучи разошлись
Листва зеленела
"""


def get_lines_from_file(filename, lines):
    pass


get_lines_from_file("article.txt", 5)

# Кипела вода в чайнике
# Венера зажглась на небе
# Деревья шумели
# Тучи разошлись
# Листва зеленела